{
    "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
    "contentVersion": "1.0.0.0",
    "parameters": {
        "workspace": {
            "type": "String"
        }
    },
    "resources": [
        {
            "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/cca6eb4d-7d5c-4cfe-b8c2-4aaa3e51a845')]",
            "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/cca6eb4d-7d5c-4cfe-b8c2-4aaa3e51a845')]",
            "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules",
            "kind": "Scheduled",
            "apiVersion": "2022-11-01-preview",
            "properties": {
                "displayName": "FW - Fortigate - a user account was deleted",
                "description": "",
                "severity": "Medium",
                "enabled": true,
                "query": "CommonSecurityLog\r\n| where Message has \"delete system.user\" or Message has \"delete user.local\"\r\n| extend Username = extract(\"FTNTFGTcfgobj=([^*]+)(;|$)\",1,AdditionalExtensions)\r\n| project TimeGenerated, DeviceAction ,Username, Computer, DeviceExternalID, SourceProcessName",
                "queryFrequency": "P1D",
                "queryPeriod": "P1D",
                "triggerOperator": "GreaterThan",
                "triggerThreshold": 0,
                "suppressionDuration": "PT5H",
                "suppressionEnabled": false,
                "tactics": [],
                "techniques": [],
                "alertRuleTemplateName": null,
                "incidentConfiguration": {
                    "createIncident": true,
                    "groupingConfiguration": {
                        "enabled": false,
                        "reopenClosedIncident": false,
                        "lookbackDuration": "PT5H",
                        "matchingMethod": "AllEntities",
                        "groupByEntities": [],
                        "groupByAlertDetails": [],
                        "groupByCustomDetails": []
                    }
                },
                "eventGroupingSettings": {
                    "aggregationKind": "SingleAlert"
                },
                "alertDetailsOverride": null,
                "customDetails": null,
                "entityMappings": null,
                "sentinelEntitiesMappings": null
            }
        }
    ]
}
