{
    "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
    "contentVersion": "1.0.0.0",
    "parameters": {
        "workspace": {
            "type": "String"
        }
    },
    "resources": [
        {
            "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/70201c21-cdbe-4f58-bc08-58e177e17971')]",
            "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/70201c21-cdbe-4f58-bc08-58e177e17971')]",
            "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules",
            "kind": "Scheduled",
            "apiVersion": "2022-11-01-preview",
            "properties": {
                "displayName": "Sentinel - No data received from log collector in 3+ hours",
                "description": "",
                "severity": "High",
                "enabled": true,
                "query": "CommonSecurityLog | union isfuzzy=true meraki_CL, Syslog\r\n| where HostName !contains \"collector\"\r\n| where TimeGenerated > ago(30d)\r\n| summarize last_log = datetime_diff(\"second\",now(), max(TimeGenerated))\r\n| where last_log >= 10800",
                "queryFrequency": "PT1H",
                "queryPeriod": "PT4H",
                "triggerOperator": "GreaterThan",
                "triggerThreshold": 0,
                "suppressionDuration": "PT5H",
                "suppressionEnabled": false,
                "tactics": [],
                "techniques": [],
                "alertRuleTemplateName": null,
                "incidentConfiguration": {
                    "createIncident": true,
                    "groupingConfiguration": {
                        "enabled": true,
                        "reopenClosedIncident": false,
                        "lookbackDuration": "P1D",
                        "matchingMethod": "AllEntities",
                        "groupByEntities": [],
                        "groupByAlertDetails": [],
                        "groupByCustomDetails": []
                    }
                },
                "eventGroupingSettings": {
                    "aggregationKind": "SingleAlert"
                },
                "alertDetailsOverride": null,
                "customDetails": null,
                "entityMappings": null,
                "sentinelEntitiesMappings": null
            }
        }
    ]
}
